const choList = ["ㄱ", "ㄲ", "ㄴ", "ㄷ", "ㄸ", "ㄹ", "ㅁ", "ㅂ", "ㅃ", "ㅅ", "ㅆ", "ㅇ", "ㅈ", "ㅉ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"];
const jungList = ["ㅏ", "ㅐ", "ㅑ", "ㅒ", "ㅓ", "ㅔ", "ㅕ", "ㅖ", "ㅗ", "ㅘ", "ㅙ", "ㅚ", "ㅛ", "ㅜ", "ㅝ", "ㅞ", "ㅟ", "ㅠ", "ㅡ", "ㅢ", "ㅣ"];
const jongList = ["", "ㄱ", "ㄲ", "ㄳ", "ㄴ", "ㄵ", "ㄶ", "ㄷ", "ㄹ", "ㄺ", "ㄻ", "ㄼ", "ㄽ", "ㄾ", "ㄿ", "ㅀ", "ㅁ", "ㅂ", "ㅄ", "ㅅ", "ㅆ", "ㅇ", "ㅈ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"];

const choMinList = {
  ㄱ: ["ㄱ"],
  ㄲ: ["ㄱ"],
  ㄴ: ["ㄴ"],
  ㄷ: ["ㄷ"],
  ㄸ: ["ㄷ"],
  ㄹ: ["ㄹ"],
  ㅁ: ["ㅁ"],
  ㅂ: ["ㅂ"],
  ㅃ: ["ㅂ"],
  ㅅ: ["ㅅ"],
  ㅆ: ["ㅅ"],
  ㅇ: ["ㅇ"],
  ㅈ: ["ㅈ"],
  ㅉ: ["ㅈ"],
  ㅊ: ["ㅊ"],
  ㅋ: ["ㅋ"],
  ㅌ: ["ㅌ"],
  ㅍ: ["ㅍ"],
  ㅎ: ["ㅎ"]
}
const jungMinList = {
  ㅏ: ["ㅏ"],
  ㅐ: ["ㅐ"],
  ㅑ: ["ㅑ"],
  ㅒ: ["ㅐ"],
  ㅓ: ["ㅓ"],
  ㅔ: ["ㅔ"],
  ㅕ: ["ㅕ"],
  ㅖ: ["ㅔ"],
  ㅗ: ["ㅗ"],
  ㅘ: ["ㅗ", "ㅏ"],
  ㅙ: ["ㅗ", "ㅐ"],
  ㅚ: ["ㅚ"],
  ㅛ: ["ㅛ"],
  ㅜ: ["ㅜ"],
  ㅝ: ["ㅜ", "ㅓ"],
  ㅞ: ["ㅜ", "ㅔ"],
  ㅟ: ["ㅜ", "ㅣ"],
  ㅠ: ["ㅠ"],
  ㅡ: ["ㅡ"],
  ㅢ: ["ㅡ", "ㅣ"],
  ㅣ: ["ㅣ"]
}
const jongMinList = {
  ㄱ: ["ㄱ"],
  ㄲ: ["ㄱ"],
  ㄳ: ["ㄱ", "ㅅ"],
  ㄴ: ["ㄴ"],
  ㄵ: ["ㄴ", "ㅈ"],
  ㄶ: ["ㄴ", "ㅎ"],
  ㄷ: ["ㄷ"],
  ㄹ: ["ㄹ"],
  ㄺ: ["ㄹ", "ㄱ"],
  ㄻ: ["ㄹ", "ㅁ"],
  ㄼ: ["ㄹ", "ㅂ"],
  ㄽ: ["ㄹ", "ㅅ"],
  ㄾ: ["ㄹ", "ㅌ"],
  ㄿ: ["ㄹ", "ㅍ"],
  ㅀ: ["ㄹ", "ㅎ"],
  ㅁ: ["ㅁ"],
  ㅂ: ["ㅂ"],
  ㅄ: ["ㅂ", "ㅅ"],
  ㅅ: ["ㅅ"],
  ㅆ: ["ㅅ"],
  ㅇ: ["ㅇ"],
  ㅈ: ["ㅈ"],
  ㅊ: ["ㅊ"],
  ㅋ: ["ㅋ"],
  ㅌ: ["ㅌ"],
  ㅍ: ["ㅍ"],
  ㅎ: ["ㅎ"]
}

const cho = word => {
  const wordCode = word.charCodeAt(0) - 0xAC00;
  let result = [];

  let jong = wordCode % 28;
  let jung = ((wordCode - jong) / 28) % 21;
  let cho = (((wordCode - jong) / 28) - jung) / 21;

  cho = choMinList[choList[cho]];
  jung = jungMinList[jungList[jung]];
  jong = jongMinList[jongList[jong]];

  result = result.concat(cho);
  result = result.concat(jung);
  if(jong) result = result.concat(jong);

  return result;
}